from ..Data.ScheduleEntry import ScheduleEntry

from datetime import date as dt
from datetime import time as tm


ScheduleList = list[ScheduleEntry]

schedule: ScheduleList = [ScheduleEntry("Математика", dt(2023, 4, 20), tm(9, 30), tm(10, 30), "Иванов", "ПИ-20-1"),
                          ScheduleEntry("Математика", dt(2023, 4, 20), tm(9, 30), tm(10, 30), "Иванов", "БИ-20-1"),
                          ScheduleEntry("Интелектуальные_системы", dt(2023, 5, 20), tm(9, 30), tm(10, 30), "Мухин", "ПИ-20-1"),
                          ScheduleEntry("Математика", dt(2023, 5, 20), tm(9, 30), tm(10, 30), "Мухин", "БИ-20-1"),
                          ScheduleEntry("C#", dt(2023, 5, 20), tm(9, 30), tm(10, 30), "Викентьева", "ПИ-20-2"),
                          ScheduleEntry("Интелектуальные_системы", dt(2023, 5, 20), tm(11, 30), tm(12, 30), "Мухин", "ПИ-20-2"),
                          ScheduleEntry("Машинное_обучение", dt(2023, 5, 20), tm(9, 30), tm(10, 30), "Соколов", "ПИ-20-2"),
                          ScheduleEntry("Английский_язык", dt(2023, 5, 20), tm(9, 30), tm(10, 30), "Яркова", "ИЯ-21-1"),
                          ScheduleEntry("Интелектуальные_системы", dt(2023, 5, 20), tm(9, 30), tm(12, 30), "НеМухин", "ПИ-21-1"),
                          ScheduleEntry("Математика", dt(2023, 6, 20), tm(9, 30), tm(10, 30), "Иванов", "ПИ-20-1"),
                          ScheduleEntry("Математика", dt(2023, 6, 20), tm(11, 30), tm(12, 30), "Иванов", "БИ-20-1"),
                          ScheduleEntry("История", dt(2023, 7, 20), tm(9, 30), tm(10, 30), "Грабарь", "ПИ-20-1"),
                          ScheduleEntry("Интелектуальные_системы", dt(2023, 5, 26), tm(11, 30), tm(12, 30), "Мухин", "ПИ-20-2"),
                          ScheduleEntry("Машинное_обучение", dt(2023, 5, 30), tm(16, 30), tm(17, 30), "Соколов", "ПИ-20-2"),
                          ScheduleEntry("Английский_язык", dt(2023, 11, 20), tm(9, 30), tm(10, 30), "Яркова", "ИЯ-21-1"),
                          ScheduleEntry("Интелектуальные_системы", dt(2023, 5, 12), tm(9, 30), tm(12, 30), "СуперМухин", "ПИ-21-1")]